Revit 2022 API
RevisionSettings.SetAlphanumericRevisionSettings Method
 Replaces the current alphanumeric revision numbering settings with the specified AlphanumericRevisionSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.SetAlphanumericRevisionSettings` instead.")]
public void SetAlphanumericRevisionSettings(
	AlphanumericRevisionSettings newSettings
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.SetAlphanumericRevisionSettings` instead.")> _
Public Sub SetAlphanumericRevisionSettings ( _
	newSettings As AlphanumericRevisionSettings _
)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.SetAlphanumericRevisionSettings` instead.")]
public:
void SetAlphanumericRevisionSettings(
	AlphanumericRevisionSettings^ newSettings
)
Parameters
newSettings
Type: Autodesk.Revit.DB.AlphanumericRevisionSettings
 The specified AlphanumericRevisionSettings to be applied to alphanumeric revision numbering.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  newSettings is not a valid AlphanumericRevisionSettings.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace